---
title : "01. DataFrame 인덱싱"
author : "GC"
date : "04/19/24"
---

# import

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# 데이터 로드

In [6]:
df = pd.read_csv("data/broadcast.csv", encoding = "utf-8", index_col = 0)

In [18]:
df

         KBS     MBC     SBS  TV CHOSUN   JTBC  Channel A    MBN
2011  35.951  18.374  11.173      9.102  7.380      3.771  2.809
2012  36.163  16.022  11.408      8.785  7.878      5.874  3.310
2013  31.989  16.778   9.673      9.026  7.810      5.350  3.825
2014  31.210  15.663   9.108      9.440  7.490      5.776  4.572
2015  27.777  16.573   9.099      9.940  7.267      6.678  5.520
2016  27.583  14.982   8.669      9.829  7.727      6.624  5.477
2017  26.890  12.465   8.661      8.886  9.453      6.056  5.215

# 인덱싱

`-` ex1. 2016년 kbs 시청률 받아오기

In [17]:
df.loc[2016, "KBS"]

27.583

`-` ex2. JTBC의 시청률 확인

In [19]:
df["JTBC"]

2011    7.380
2012    7.878
2013    7.810
2014    7.490
2015    7.267
2016    7.727
2017    9.453
Name: JTBC, dtype: float64

`-` ex3. SBS와 JTBC의 시청률만 확인

In [20]:
df[["SBS","JTBC"]]

         SBS   JTBC
2011  11.173  7.380
2012  11.408  7.878
2013   9.673  7.810
2014   9.108  7.490
2015   9.099  7.267
2016   8.669  7.727
2017   8.661  9.453

`-` ex4. 삼송카드, 현디카드 요일별 문화생활비 분석

In [49]:
samsong_df = pd.read_csv('data/samsong.csv')
hyundee_df = pd.read_csv('data/hyundee.csv')

In [50]:
samsong_df

    요일     식비   교통비  문화생활비    기타
0  MON  19420  2560   4308  3541
1  TUE  16970  2499   7644  2903
2  WED  15091  2511   5674  2015
3  THU  17880  2545   8621  3012
4  FRI  27104  2993  23052  2508
5  SAT  29055  2803  15330  4901
6  SUN  23509  1760  19030  4230

In [52]:
hyundee_df

    요일     식비   교통비  문화생활비    기타
0  MON  22420  2574   5339  5546
1  TUE  19940  2689   3524  2501
2  WED  18086  2281   5364  2234
3  THU  18863  2155   9942  3252
4  FRI  35144  2463  33511  2342
5  SAT  34952  2812  19397  4324
6  SUN  28513  2680  19925  4577

In [55]:
day = samsong_df["요일"]
samsong = samsong_df["문화생활비"]
hyundee = hyundee_df["문화생활비"]

df = pd.DataFrame([day,samsong,hyundee]).T

df.columns = ["day", "samsong", "hyundee"]
df

   day samsong hyundee
0  MON    4308    5339
1  TUE    7644    3524
2  WED    5674    5364
3  THU    8621    9942
4  FRI   23052   33511
5  SAT   15330   19397
6  SUN   19030   19925

`-` ex5. `KBS ~ SBS`, `2012 ~ 2017` 까지의 시청률 데이터만 확인

In [56]:
df = pd.read_csv('data/broadcast.csv', index_col=0)

In [59]:
df.loc[2012:2017, "KBS" : "SBS"]

         KBS     MBC     SBS
2012  36.163  16.022  11.408
2013  31.989  16.778   9.673
2014  31.210  15.663   9.108
2015  27.777  16.573   9.099
2016  27.583  14.982   8.669
2017  26.890  12.465   8.661

`-` ex6. KBS 시청률이 30이 넘은 데이터만 확인해보기

In [60]:
df.loc[df.KBS > 30, "KBS"]

2011    35.951
2012    36.163
2013    31.989
2014    31.210
Name: KBS, dtype: float64

`-` ex7. SBS가 TV CHOSUN보다 더 시청률이 낮았던 시기의 데이터 확인

In [63]:
df.loc[df.SBS < df["TV CHOSUN"], ["SBS","TV CHOSUN"]]

        SBS  TV CHOSUN
2014  9.108      9.440
2015  9.099      9.940
2016  8.669      9.829
2017  8.661      8.886